#![allow(non_upper_case_globals)]
#![allow(non_camel_case_types)]
#![allow(non_snake_case)]

/* automatically generated by rust-bindgen 0.60.1 */

pub const true_: u32 = 1;
pub const false_: u32 = 0;
pub const __bool_true_false_are_defined: u32 = 1;
pub const _STDINT_H: u32 = 1;
pub const _FEATURES_H: u32 = 1;
pub const _DEFAULT_SOURCE: u32 = 1;
pub const __GLIBC_USE_ISOC2X: u32 = 0;
pub const __USE_ISOC11: u32 = 1;
pub const __USE_ISOC99: u32 = 1;
pub const __USE_ISOC95: u32 = 1;
pub const __USE_POSIX_IMPLICITLY: u32 = 1;
pub const _POSIX_SOURCE: u32 = 1;
pub const _POSIX_C_SOURCE: u32 = 200809;
pub const __USE_POSIX: u32 = 1;
pub const __USE_POSIX2: u32 = 1;
pub const __USE_POSIX199309: u32 = 1;
pub const __USE_POSIX199506: u32 = 1;
pub const __USE_XOPEN2K: u32 = 1;
pub const __USE_XOPEN2K8: u32 = 1;
pub const _ATFILE_SOURCE: u32 = 1;
pub const __WORDSIZE: u32 = 64;
pub const __WORDSIZE_TIME64_COMPAT32: u32 = 1;
pub const __SYSCALL_WORDSIZE: u32 = 64;
pub const __TIMESIZE: u32 = 64;
pub const __USE_MISC: u32 = 1;
pub const __USE_ATFILE: u32 = 1;
pub const __USE_FORTIFY_LEVEL: u32 = 0;
pub const __GLIBC_USE_DEPRECATED_GETS: u32 = 0;
pub const __GLIBC_USE_DEPRECATED_SCANF: u32 = 0;
pub const _STDC_PREDEF_H: u32 = 1;
pub const __STDC_IEC_559__: u32 = 1;
pub const __STDC_IEC_60559_BFP__: u32 = 201404;
pub const __STDC_IEC_559_COMPLEX__: u32 = 1;
pub const __STDC_IEC_60559_COMPLEX__: u32 = 201404;
pub const __STDC_ISO_10646__: u32 = 201706;
pub const __GNU_LIBRARY__: u32 = 6;

pub const projectMKeycode_PROJECTM_K_h: projectMKeycode = 104;
#[doc = " Keycodes"]
pub const projectMKeycode_PROJECTM_K_i: projectMKeycode = 105;
#[doc = " Keycodes"]
pub const projectMKeycode_PROJECTM_K_j: projectMKeycode = 106;
#[doc = " Keycodes"]
pub const projectMKeycode_PROJECTM_K_k: projectMKeycode = 107;
#[doc = " Keycodes"]
pub const projectMKeycode_PROJECTM_K_l: projectMKeycode = 108;
#[doc = " Keycodes"]
pub const projectMKeycode_PROJECTM_K_m: projectMKeycode = 109;
#[doc = " Keycodes"]
pub const projectMKeycode_PROJECTM_K_n: projectMKeycode = 110;
#[doc = " Keycodes"]
pub const projectMKeycode_PROJECTM_K_o: projectMKeycode = 111;
#[doc = " Keycodes"]
pub const projectMKeycode_PROJECTM_K_p: projectMKeycode = 112;
#[doc = " Keycodes"]
pub const projectMKeycode_PROJECTM_K_q: projectMKeycode = 113;
#[doc = " Keycodes"]
pub const projectMKeycode_PROJECTM_K_r: projectMKeycode = 114;
#[doc = " Keycodes"]
pub const projectMKeycode_PROJECTM_K_s: projectMKeycode = 115;
#[doc = " Keycodes"]
pub const projectMKeycode_PROJECTM_K_t: projectMKeycode = 116;
#[doc = " Keycodes"]
pub const projectMKeycode_PROJECTM_K_u: projectMKeycode = 117;
#[doc = " Keycodes"]
pub const projectMKeycode_PROJECTM_K_v: projectMKeycode = 118;
#[doc = " Keycodes"]
pub const projectMKeycode_PROJECTM_K_w: projectMKeycode = 119;
#[doc = " Keycodes"]
pub const projectMKeycode_PROJECTM_K_x: projectMKeycode = 120;
#[doc = " Keycodes"]
pub const projectMKeycode_PROJECTM_K_y: projectMKeycode = 121;
#[doc = " Keycodes"]
pub const projectMKeycode_PROJECTM_K_z: projectMKeycode = 122;
#[doc = " Keycodes"]
pub const projectMKeycode_PROJECTM_K_NONE: projectMKeycode = 123;
#[doc = " Keycodes"]
pub const projectMKeycode_PROJECTM_K_PLUS: projectMKeycode = 124;
#[doc = " Keycodes"]
pub const projectMKeycode_PROJECTM_K_MINUS: projectMKeycode = 125;
#[doc = " Keycodes"]
pub const projectMKeycode_PROJECTM_K_EQUALS: projectMKeycode = 126;
pub type projectMKeycode = ::std::os::raw::c_uint;
#[doc = " Modifiers"]
pub const projectMModifier_PROJECTM_KMOD_NONE: projectMModifier = -1;
#[doc = " Modifiers"]
pub const projectMModifier_PROJECTM_KMOD_LSHIFT: projectMModifier = 0;
#[doc = " Modifiers"]
pub const projectMModifier_PROJECTM_KMOD_RSHIFT: projectMModifier = 1;
#[doc = " Modifiers"]
pub const projectMModifier_PROJECTM_KMOD_CAPS: projectMModifier = 2;
#[doc = " Modifiers"]
pub const projectMModifier_PROJECTM_KMOD_LCTRL: projectMModifier = 3;
#[doc = " Modifiers"]
pub const projectMModifier_PROJECTM_KMOD_RCTRL: projectMModifier = 4;
pub type projectMModifier = ::std::os::raw::c_int;
pub type size_t = ::std::os::raw::c_ulong;
pub type wchar_t = ::std::os::raw::c_int;
#[repr(C)]
#[repr(align(16))]
#[derive(Debug, Copy, Clone)]
pub struct max_align_t {
    pub __clang_max_align_nonce1: ::std::os::raw::c_longlong,
    pub __bindgen_padding_0: u64,
    pub __clang_max_align_nonce2: u128,
}
#[test]
fn bindgen_test_layout_max_align_t() {
    assert_eq!(
        ::std::mem::size_of::<max_align_t>(),
        32usize,
        concat!("Size of: ", stringify!(max_align_t))
    );
    assert_eq!(
        ::std::mem::align_of::<max_align_t>(),
        16usize,
        concat!("Alignment of ", stringify!(max_align_t))
    );
    fn test_field___clang_max_align_nonce1() {
        assert_eq!(
            unsafe {
                let uninit = ::std::mem::MaybeUninit::<max_align_t>::uninit();
                let ptr = uninit.as_ptr();
                ::std::ptr::addr_of!((*ptr).__clang_max_align_nonce1) as usize - ptr as usize
            },
            0usize,
            concat!(
                "Offset of field: ",
                stringify!(max_align_t),
                "::",
                stringify!(__clang_max_align_nonce1)
            )
        );
    }
    test_field___clang_max_align_nonce1();
    fn test_field___clang_max_align_nonce2() {
        assert_eq!(
            unsafe {
                let uninit = ::std::mem::MaybeUninit::<max_align_t>::uninit();
                let ptr = uninit.as_ptr();
                ::std::ptr::addr_of!((*ptr).__clang_max_align_nonce2) as usize - ptr as usize
            },
            16usize,
            concat!(
                "Offset of field: ",
                stringify!(max_align_t),
                "::",
                stringify!(__clang_max_align_nonce2)
            )
        );
    }
    test_field___clang_max_align_nonce2();
}
pub type __u_char = ::std::os::raw::c_uchar;
pub type __u_short = ::std::os::raw::c_ushort;
pub type __u_int = ::std::os::raw::c_uint;
pub type __u_long = ::std::os::raw::c_ulong;
pub type __int8_t = ::std::os::raw::c_schar;
pub type __uint8_t = ::std::os::raw::c_uchar;
pub type __int16_t = ::std::os::raw::c_short;
pub type __uint16_t = ::std::os::raw::c_ushort;
pub type __int32_t = ::std::os::raw::c_int;
pub type __uint32_t = ::std::os::raw::c_uint;
pub type __int64_t = ::std::os::raw::c_long;
pub type __uint64_t = ::std::os::raw::c_ulong;
pub type __int_least8_t = __int8_t;
pub type __uint_least8_t = __uint8_t;
pub type __int_least16_t = __int16_t;
pub type __uint_least16_t = __uint16_t;
pub type __int_least32_t = __int32_t;
pub type __uint_least32_t = __uint32_t;
pub type __int_least64_t = __int64_t;
pub type __uint_least64_t = __uint64_t;
pub type __quad_t = ::std::os::raw::c_long;
pub type __u_quad_t = ::std::os::raw::c_ulong;
pub type __intmax_t = ::std::os::raw::c_long;
pub type __uintmax_t = ::std::os::raw::c_ulong;
pub type __dev_t = ::std::os::raw::c_ulong;
pub type __uid_t = ::std::os::raw::c_uint;
pub type __gid_t = ::std::os::raw::c_uint;
pub type __ino_t = ::std::os::raw::c_ulong;
pub type __ino64_t = ::std::os::raw::c_ulong;
pub type __mode_t = ::std::os::raw::c_uint;
pub type __nlink_t = ::std::os::raw::c_ulong;
pub type __off_t = ::std::os::raw::c_long;
pub type __off64_t = ::std::os::raw::c_long;
pub type __pid_t = ::std::os::raw::c_int;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct __fsid_t {
    pub __val: [::std::os::raw::c_int; 2usize],
}
#[test]
fn bindgen_test_layout___fsid_t() {
    assert_eq!(
        ::std::mem::size_of::<__fsid_t>(),
        8usize,
        concat!("Size of: ", stringify!(__fsid_t))
    );
    assert_eq!(
        ::std::mem::align_of::<__fsid_t>(),
        4usize,
        concat!("Alignment of ", stringify!(__fsid_t))
    );
    fn test_field___val() {
        assert_eq!(
            unsafe {
                let uninit = ::std::mem::MaybeUninit::<__fsid_t>::uninit();
                let ptr = uninit.as_ptr();
                ::std::ptr::addr_of!((*ptr).__val) as usize - ptr as usize
            },
            0usize,
            concat!(
                "Offset of field: ",
                stringify!(__fsid_t),
                "::",
                stringify!(__val)
            )
        );
    }
    test_field___val();
}
pub type __clock_t = ::std::os::raw::c_long;
pub type __rlim_t = ::std::os::raw::c_ulong;
pub type __rlim64_t = ::std::os::raw::c_ulong;
pub type __id_t = ::std::os::raw::c_uint;
pub type __time_t = ::std::os::raw::c_long;
pub type __useconds_t = ::std::os::raw::c_uint;
pub type __suseconds_t = ::std::os::raw::c_long;
pub type __suseconds64_t = ::std::os::raw::c_long;
pub type __daddr_t = ::std::os::raw::c_int;
pub type __key_t = ::std::os::raw::c_int;
pub type __clockid_t = ::std::os::raw::c_int;
pub type __timer_t = *mut ::std::os::raw::c_void;
pub type __blksize_t = ::std::os::raw::c_long;
pub type __blkcnt_t = ::std::os::raw::c_long;
pub type __blkcnt64_t = ::std::os::raw::c_long;
pub type __fsblkcnt_t = ::std::os::raw::c_ulong;
pub type __fsblkcnt64_t = ::std::os::raw::c_ulong;
pub type __fsfilcnt_t = ::std::os::raw::c_ulong;
pub type __fsfilcnt64_t = ::std::os::raw::c_ulong;
pub type __fsword_t = ::std::os::raw::c_long;
pub type __ssize_t = ::std::os::raw::c_long;
pub type __syscall_slong_t = ::std::os::raw::c_long;
pub type __syscall_ulong_t = ::std::os::raw::c_ulong;
pub type __loff_t = __off64_t;
pub type __caddr_t = *mut ::std::os::raw::c_char;
pub type __intptr_t = ::std::os::raw::c_long;
pub type __socklen_t = ::std::os::raw::c_uint;
pub type __sig_atomic_t = ::std::os::raw::c_int;
pub type int_least8_t = __int_least8_t;
pub type int_least16_t = __int_least16_t;
pub type int_least32_t = __int_least32_t;
pub type int_least64_t = __int_least64_t;
pub type uint_least8_t = __uint_least8_t;
pub type uint_least16_t = __uint_least16_t;
pub type uint_least32_t = __uint_least32_t;
pub type uint_least64_t = __uint_least64_t;
pub type int_fast8_t = ::std::os::raw::c_schar;
pub type int_fast16_t = ::std::os::raw::c_long;
pub type int_fast32_t = ::std::os::raw::c_long;
pub type int_fast64_t = ::std::os::raw::c_long;
pub type uint_fast8_t = ::std::os::raw::c_uchar;
pub type uint_fast16_t = ::std::os::raw::c_ulong;
pub type uint_fast32_t = ::std::os::raw::c_ulong;
pub type uint_fast64_t = ::std::os::raw::c_ulong;
pub type intmax_t = __intmax_t;
pub type uintmax_t = __uintmax_t;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct projectm {
    _unused: [u8; 0],
}
pub type projectm_handle = *mut projectm;
#[doc = " @brief projectM instance settings."]
#[doc = ""]
#[doc = " <p>Use this struct to provide settings for projectM, for example if your application handles projectM configuration"]
#[doc = " internally instead of using the default configuration file.</p>"]
#[doc = ""]
#[doc = " <p>Always allocate the struct using the projectm_alloc_settings() and free it with the projectm_free_settings()"]
#[doc = " function.</p>"]
#[doc = ""]
#[doc = " <p>To allocate memory for char* members, always use projectm_alloc_string(). If any pointer is not NULL,"]
#[doc = " projectm_free_settings() will automatically call projectm_free_string() on it. If you free it on your own, remember"]
#[doc = " to reset the pointer to NULL after doing so!</p>"]
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct projectm_settings_s {
    #[doc = "!< Per-pixel mesh X resolution."]
    pub mesh_x: ::std::os::raw::c_int,
    #[doc = "!< Per-pixel mesh Y resolution."]
    pub mesh_y: ::std::os::raw::c_int,
    #[doc = "!< Target rendering frames per second."]
    pub fps: ::std::os::raw::c_int,
    #[doc = "!< Size of the render texture. Must be a power of 2."]
    pub texture_size: ::std::os::raw::c_int,
    #[doc = "!< Width of the rendering viewport."]
    pub window_width: ::std::os::raw::c_int,
    #[doc = "!< Height of the rendering viewport."]
    pub window_height: ::std::os::raw::c_int,
    #[doc = "!< Path to a preset playlist in XML format to be loaded. Use FLAG_DISABLE_PLAYLIST_LOAD to skip loading a playlist."]
    pub preset_url: *mut ::std::os::raw::c_char,
    #[doc = "!< Path to the \"title\" font that is used to render the preset name."]
    pub title_font_url: *mut ::std::os::raw::c_char,
    #[doc = "!< Path to the \"menu\" font that is used to render the built-in on-screen menu."]
    pub menu_font_url: *mut ::std::os::raw::c_char,
    #[doc = "!< Path to data files like default fonts and presets."]
    pub data_dir: *mut ::std::os::raw::c_char,
    #[doc = "!< Display duration for each preset in seconds."]
    pub preset_duration: f64,
    #[doc = "!< Blend-over duration between two presets in seconds."]
    pub soft_cut_duration: f64,
    #[doc = "!< Minimum time in seconds a preset is displayed before a hard cut can happen."]
    pub hard_cut_duration: f64,
    #[doc = "!< Set to true to enable fast beat-driven preset switches."]
    pub hard_cut_enabled: bool,
    #[doc = "!< Beat sensitivity value that must be surpassed for a hard cut."]
    pub hard_cut_sensitivity: f32,
    #[doc = "!< Beat sensitivity. Standard sensitivity is 1.0."]
    pub beat_sensitivity: f32,
    #[doc = "!< Use aspect ration correction in presets that support it."]
    pub aspect_correction: bool,
    #[doc = "!< Used as the \"sigma\" value for a gaussian RNG to randomize preset duration. Unused on Windows."]
    pub easter_egg: f32,
    #[doc = "!< Enable playlist shuffle, selecting a random preset on each switch instead of the next in list."]
    pub shuffle_enabled: bool,
    #[doc = "!< If true, use soft cut ratings on soft cuts and hard cut ratings on hard cuts. If false, the hard cut rating is always used."]
    pub soft_cut_ratings_enabled: bool,
}
#[test]
fn bindgen_test_layout_projectm_settings_s() {
    assert_eq!(
        ::std::mem::size_of::<projectm_settings_s>(),
        104usize,
        concat!("Size of: ", stringify!(projectm_settings_s))
    );
    assert_eq!(
        ::std::mem::align_of::<projectm_settings_s>(),
        8usize,
        concat!("Alignment of ", stringify!(projectm_settings_s))
    );
    fn test_field_mesh_x() {
        assert_eq!(
            unsafe {
                let uninit = ::std::mem::MaybeUninit::<projectm_settings_s>::uninit();
                let ptr = uninit.as_ptr();
                ::std::ptr::addr_of!((*ptr).mesh_x) as usize - ptr as usize
            },
            0usize,
            concat!(
                "Offset of field: ",
                stringify!(projectm_settings_s),
                "::",
                stringify!(mesh_x)
            )
        );
    }
    test_field_mesh_x();
    fn test_field_mesh_y() {
        assert_eq!(
            unsafe {
                let uninit = ::std::mem::MaybeUninit::<projectm_settings_s>::uninit();
                let ptr = uninit.as_ptr();
                ::std::ptr::addr_of!((*ptr).mesh_y) as usize - ptr as usize
            },
            4usize,
            concat!(
                "Offset of field: ",
                stringify!(projectm_settings_s),
                "::",
                stringify!(mesh_y)
            )
        );
    }
    test_field_mesh_y();
    fn test_field_fps() {
        assert_eq!(
            unsafe {
                let uninit = ::std::mem::MaybeUninit::<projectm_settings_s>::uninit();
                let ptr = uninit.as_ptr();
                ::std::ptr::addr_of!((*ptr).fps) as usize - ptr as usize
            },
            8usize,
            concat!(
                "Offset of field: ",
                stringify!(projectm_settings_s),
                "::",
                stringify!(fps)
            )
        );
    }
    test_field_fps();
    fn test_field_texture_size() {
        assert_eq!(
            unsafe {
                let uninit = ::std::mem::MaybeUninit::<projectm_settings_s>::uninit();
                let ptr = uninit.as_ptr();
                ::std::ptr::addr_of!((*ptr).texture_size) as usize - ptr as usize
            },
            12usize,
            concat!(
                "Offset of field: ",
                stringify!(projectm_settings_s),
                "::",
                stringify!(texture_size)
            )
        );
    }
    test_field_texture_size();
    fn test_field_window_width() {
        assert_eq!(
            unsafe {
                let uninit = ::std::mem::MaybeUninit::<projectm_settings_s>::uninit();
                let ptr = uninit.as_ptr();
                ::std::ptr::addr_of!((*ptr).window_width) as usize - ptr as usize
            },
            16usize,
            concat!(
                "Offset of field: ",
                stringify!(projectm_settings_s),
                "::",
                stringify!(window_width)
            )
        );
    }
    test_field_window_width();
    fn test_field_window_height() {
        assert_eq!(
            unsafe {
                let uninit = ::std::mem::MaybeUninit::<projectm_settings_s>::uninit();
                let ptr = uninit.as_ptr();
                ::std::ptr::addr_of!((*ptr).window_height) as usize - ptr as usize
            },
            20usize,
            concat!(
                "Offset of field: ",
                stringify!(projectm_settings_s),
                "::",
                stringify!(window_height)
            )
        );
    }
    test_field_window_height();
    fn test_field_preset_url() {
        assert_eq!(
            unsafe {
                let uninit = ::std::mem::MaybeUninit::<projectm_settings_s>::uninit();
                let ptr = uninit.as_ptr();
                ::std::ptr::addr_of!((*ptr).preset_url) as usize - ptr as usize
            },
            24usize,
            concat!(
                "Offset of field: ",
                stringify!(projectm_settings_s),
                "::",
                stringify!(preset_url)
            )
        );
    }
    test_field_preset_url();
    fn test_field_title_font_url() {
        assert_eq!(
            unsafe {
                let uninit = ::std::mem::MaybeUninit::<projectm_settings_s>::uninit();
                let ptr = uninit.as_ptr();
                ::std::ptr::addr_of!((*ptr).title_font_url) as usize - ptr as usize
            },
            32usize,
            concat!(
                "Offset of field: ",
                stringify!(projectm_settings_s),
                "::",
                stringify!(title_font_url)
            )
        );
    }
    test_field_title_font_url();
    fn test_field_menu_font_url() {
        assert_eq!(
            unsafe {
                let uninit = ::std::mem::MaybeUninit::<projectm_settings_s>::uninit();
                let ptr = uninit.as_ptr();
                ::std::ptr::addr_of!((*ptr).menu_font_url) as usize - ptr as usize
            },
            40usize,
            concat!(
                "Offset of field: ",
                stringify!(projectm_settings_s),
                "::",
                stringify!(menu_font_url)
            )
        );
    }
    test_field_menu_font_url();
    fn test_field_data_dir() {
        assert_eq!(
            unsafe {
                let uninit = ::std::mem::MaybeUninit::<projectm_settings_s>::uninit();
                let ptr = uninit.as_ptr();
                ::std::ptr::addr_of!((*ptr).data_dir) as usize - ptr as usize
            },
            48usize,
            concat!(
                "Offset of field: ",
                stringify!(projectm_settings_s),
                "::",
                stringify!(data_dir)
            )
        );
    }
    test_field_data_dir();
    fn test_field_preset_duration() {
        assert_eq!(
            unsafe {
                let uninit = ::std::mem::MaybeUninit::<projectm_settings_s>::uninit();
                let ptr = uninit.as_ptr();
                ::std::ptr::addr_of!((*ptr).preset_duration) as usize - ptr as usize
            },
            56usize,
            concat!(
                "Offset of field: ",
                stringify!(projectm_settings_s),
                "::",
                stringify!(preset_duration)
            )
        );
    }
    test_field_preset_duration();
    fn test_field_soft_cut_duration() {
        assert_eq!(
            unsafe {
                let uninit = ::std::mem::MaybeUninit::<projectm_settings_s>::uninit();
                let ptr = uninit.as_ptr();
                ::std::ptr::addr_of!((*ptr).soft_cut_duration) as usize - ptr as usize
            },
            64usize,
            concat!(
                "Offset of field: ",
                stringify!(projectm_settings_s),
                "::",
                stringify!(soft_cut_duration)
            )
        );
    }
    test_field_soft_cut_duration();
    fn test_field_hard_cut_duration() {
        assert_eq!(
            unsafe {
                let uninit = ::std::mem::MaybeUninit::<projectm_settings_s>::uninit();
                let ptr = uninit.as_ptr();
                ::std::ptr::addr_of!((*ptr).hard_cut_duration) as usize - ptr as usize
            },
            72usize,
            concat!(
                "Offset of field: ",
                stringify!(projectm_settings_s),
                "::",
                stringify!(hard_cut_duration)
            )
        );
    }
    test_field_hard_cut_duration();
    fn test_field_hard_cut_enabled() {
        assert_eq!(
            unsafe {
                let uninit = ::std::mem::MaybeUninit::<projectm_settings_s>::uninit();
                let ptr = uninit.as_ptr();
                ::std::ptr::addr_of!((*ptr).hard_cut_enabled) as usize - ptr as usize
            },
            80usize,
            concat!(
                "Offset of field: ",
                stringify!(projectm_settings_s),
                "::",
                stringify!(hard_cut_enabled)
            )
        );
    }
    test_field_hard_cut_enabled();
    fn test_field_hard_cut_sensitivity() {
        assert_eq!(
            unsafe {
                let uninit = ::std::mem::MaybeUninit::<projectm_settings_s>::uninit();
                let ptr = uninit.as_ptr();
                ::std::ptr::addr_of!((*ptr).hard_cut_sensitivity) as usize - ptr as usize
            },
            84usize,
            concat!(
                "Offset of field: ",
                stringify!(projectm_settings_s),
                "::",
                stringify!(hard_cut_sensitivity)
            )
        );
    }
    test_field_hard_cut_sensitivity();
    fn test_field_beat_sensitivity() {
        assert_eq!(
            unsafe {
                let uninit = ::std::mem::MaybeUninit::<projectm_settings_s>::uninit();
                let ptr = uninit.as_ptr();
                ::std::ptr::addr_of!((*ptr).beat_sensitivity) as usize - ptr as usize
            },
            88usize,
            concat!(
                "Offset of field: ",
                stringify!(projectm_settings_s),
                "::",
                stringify!(beat_sensitivity)
            )
        );
    }
    test_field_beat_sensitivity();
    fn test_field_aspect_correction() {
        assert_eq!(
            unsafe {
                let uninit = ::std::mem::MaybeUninit::<projectm_settings_s>::uninit();
                let ptr = uninit.as_ptr();
                ::std::ptr::addr_of!((*ptr).aspect_correction) as usize - ptr as usize
            },
            92usize,
            concat!(
                "Offset of field: ",
                stringify!(projectm_settings_s),
                "::",
                stringify!(aspect_correction)
            )
        );
    }
    test_field_aspect_correction();
    fn test_field_easter_egg() {
        assert_eq!(
            unsafe {
                let uninit = ::std::mem::MaybeUninit::<projectm_settings_s>::uninit();
                let ptr = uninit.as_ptr();
                ::std::ptr::addr_of!((*ptr).easter_egg) as usize - ptr as usize
            },
            96usize,
            concat!(
                "Offset of field: ",
                stringify!(projectm_settings_s),
                "::",
                stringify!(easter_egg)
            )
        );
    }
    test_field_easter_egg();
    fn test_field_shuffle_enabled() {
        assert_eq!(
            unsafe {
                let uninit = ::std::mem::MaybeUninit::<projectm_settings_s>::uninit();
                let ptr = uninit.as_ptr();
                ::std::ptr::addr_of!((*ptr).shuffle_enabled) as usize - ptr as usize
            },
            100usize,
            concat!(
                "Offset of field: ",
                stringify!(projectm_settings_s),
                "::",
                stringify!(shuffle_enabled)
            )
        );
    }
    test_field_shuffle_enabled();
    fn test_field_soft_cut_ratings_enabled() {
        assert_eq!(
            unsafe {
                let uninit = ::std::mem::MaybeUninit::<projectm_settings_s>::uninit();
                let ptr = uninit.as_ptr();
                ::std::ptr::addr_of!((*ptr).soft_cut_ratings_enabled) as usize - ptr as usize
            },
            101usize,
            concat!(
                "Offset of field: ",
                stringify!(projectm_settings_s),
                "::",
                stringify!(soft_cut_ratings_enabled)
            )
        );
    }
    test_field_soft_cut_ratings_enabled();
}
#[doc = " @brief projectM instance settings."]
#[doc = ""]
#[doc = " <p>Use this struct to provide settings for projectM, for example if your application handles projectM configuration"]
#[doc = " internally instead of using the default configuration file.</p>"]
#[doc = ""]
#[doc = " <p>Always allocate the struct using the projectm_alloc_settings() and free it with the projectm_free_settings()"]
#[doc = " function.</p>"]
#[doc = ""]
#[doc = " <p>To allocate memory for char* members, always use projectm_alloc_string(). If any pointer is not NULL,"]
#[doc = " projectm_free_settings() will automatically call projectm_free_string() on it. If you free it on your own, remember"]
#[doc = " to reset the pointer to NULL after doing so!</p>"]
